Catalogs/Автоработы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Автоработы</Name>
			<Comment>Автоработы</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Номер автоработы по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование автоработы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Базовая номенклатура автоработы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Comment>Время выполнения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OPERACODV2_ВидНормировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OPERACODV2_СложностьРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OPERACODE_СложностьРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OPERACODV2_ВидРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OPERACODE_ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоОкраска</Name>
					<Comment>Это окраска</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеПредложение</Name>
					<Comment>Признак того что эта авторабота является дополнительным предложением</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьДанныеВЗаявкеНаРемонт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нормочас</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Нормочасы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Протокол</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПакетДляКомплектации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НормыВремени</Name>
					<Comment>Нормы времени выполнения работы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Comment>Модель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантКомплектации</Name>
							<Comment>Вариант комплектации автомобиля</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения</Name>
							<Comment>Время выполнения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НормыРасходаМатериалов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>В регистре хранятся значения дополнительных свойств объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект (справочник или документ) для которого существуют и могут быть назначены дополнительные свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НазначенияСвойствОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>Вид свойства</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыИспользованияАвторабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыИспользованияАвторабот</Name>
			<Comment>Виды использования авторабот</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
					<Comment>Производство</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Планирование</Name>
					<Comment>Планирование</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланированиеИПроизводство</Name>
					<Comment>Планирование и производство</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Автоработы/Ext/ManagerModule.bsl
// процедура заполнения предопределенных элементов
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	
	СписокРабот = Новый СписокЗначений;
	СписокРабот.Добавить(Справочники.Автоработы.Приемка);
	СписокРабот.Добавить(Справочники.Автоработы.Выдача);
	
	Для Каждого ТекЭлемент Из СписокРабот Цикл
		ТекРабота = ТекЭлемент.Значение;
		СвойствоВидИспользования = ПланыВидовХарактеристик.СвойстваОбъектов.ВидИспользованияАвтоработы;
		ВидИспользованияЗначениеСвойства = обПолучитьЗначениеСвойства(ТекРабота,СвойствоВидИспользования);
		Если НЕ ЗначениеЗаполнено(ВидИспользованияЗначениеСвойства) Тогда
			НаборЗаписейЗначенияСвойствОбъектов	= РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
			НаборЗаписейЗначенияСвойствОбъектов.Отбор.Объект.Значение = ТекРабота;
			НаборЗаписейЗначенияСвойствОбъектов.Отбор.Объект.Использование = Истина;
			НаборЗаписейЗначенияСвойствОбъектов.Отбор.Свойство.Значение = СвойствоВидИспользования;
			НаборЗаписейЗначенияСвойствОбъектов.Отбор.Свойство.Использование = Истина;
			НаборЗаписейЗначенияСвойствОбъектов.Прочитать();
			НаборЗаписейЗначенияСвойствОбъектов.Очистить();
			НоваяЗапись = НаборЗаписейЗначенияСвойствОбъектов.Добавить();
			НоваяЗапись.Объект = ТекРабота;
			НоваяЗапись.Свойство = СвойствоВидИспользования;
			НоваяЗапись.Значение = Перечисления.ВидыИспользованияАвторабот.ПланированиеИПроизводство;
			Попытка
				НаборЗаписейЗначенияСвойствОбъектов.Записать();	
			Исключение
				Сообщить("Не удалось записать значение свойства  " + Строка(СвойствоВидИспользования) + " для " + Строка(ТекРабота), СтатусСообщения.Важное);	
			КонецПопытки;
		КонецЕсли;
		
		Объект = ТекРабота.ПолучитьОбъект();
		Объект.НаименованиеПолное = Объект.Наименование;
		Объект.Номенклатура = Справочники.Номенклатура.Авторабота;
		Объект.ОбменДанными.Загрузка = Истина;
		Попытка
			Объект.Записать();
		Исключение
			Сообщить("Ошибка обновления автоработы <"+Объект+">: "+ОписаниеОшибки());
		КонецПопытки; 
		
	КонецЦикла
	
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()

//Бондаренко++ 20220403
Процедура СМГ_УстановитьФильтрРабот(ФормаВыбора,Владелец) Экспорт
  	СимволВолгодонск = Справочники.Организации.НайтиПоКоду("ЦБ000022");
	Если Владелец.Организация = СимволВолгодонск И Владелец.Дата > '2021.06.23' Тогда
		ГруппаRenault = Справочники.Автоработы.НайтиПоКоду("ЦБ0008937");
		ТекущийОтбор = ФормаВыбора.СправочникСписок.Отбор;
		ТекущийОтбор.Ссылка.ВидСравнения  = ВидСравнения.ВИерархии;
		ТекущийОтбор.Ссылка.Значение = ГруппаRenault;
		ТекущийОтбор.Ссылка.Использование = Истина;
		ФормаВыбора.ЭлементыФормы.Список.НастройкаОтбора.Ссылка.Доступность = Ложь;
	Иначе
		СписокПодключенныхПодразделений = Новый СписокЗначений();
 		ШахтыХендэ = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001221");
		СписокПодключенныхПодразделений.Добавить(ШахтыХендэ);

		//Бондаренко++ 20220524
		ДельтаМоторс = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001166");
		СписокПодключенныхПодразделений.Добавить(ДельтаМоторс);
  		//Бондаренко++ 20220524
		
		//Здесь будут добавляться другие подразделения
 		
 		СписокКузовныхВидовРемонта = Новый СписокЗначений();
		СписокКузовныхВидовРемонта.Добавить(Справочники.ВидыРемонта.КузовнойРемонт);
		СписокКузовныхВидовРемонта.Добавить(Справочники.ВидыРемонта.КузовнойКоммерческий);		
		Если СписокКузовныхВидовРемонта.НайтиПоЗначению(Владелец.ВидРемонта) = Неопределено Тогда
			 Если Владелец.Дата > '2022.05.01' Тогда
				Если СМГ_ПодразделениеВИерархии(Владелец.ПодразделениеКомпании,СписокПодключенныхПодразделений) Тогда
	        		ТекущийОтбор = ФормаВыбора.СправочникСписок.Отбор;
					ТекущийОтбор.Ссылка.ВидСравнения  = ВидСравнения.ВСписке;
					ТекущийОтбор.Ссылка.Значение = СМГ_ПолучитьСписокРабот(Владелец.Автомобиль.Модель);
					ТекущийОтбор.Ссылка.Использование = Истина;
					ФормаВыбора.ЭлементыФормы.Список.НастройкаОтбора.Ссылка.Доступность = Ложь;
 				КонецЕсли;
			 КонецЕсли; 
 		КонецЕсли;
 	КонецЕсли;
КонецПроцедуры 

Функция СМГ_ПодразделениеВИерархии(ТекущееПодразделение,СписокПодразделений) Экспорт
	
	фл_ПодразделениеВИерархии = Ложь;
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияКомпании.Ссылка,
		|	ПодразделенияКомпании.Родитель
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	ПодразделенияКомпании.Родитель В (&СписокПодразделений)
		|	И ПодразделенияКомпании.Ссылка = &ТекущееПодразделение";
	
	Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
	Запрос.УстановитьПараметр("ТекущееПодразделение", ТекущееПодразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		фл_ПодразделениеВИерархии = Истина;
	КонецЦикла;
	
	Возврат фл_ПодразделениеВИерархии; 
 
КонецФункции // СМГ_ПодразделениеВИерархии(ТекущееПодразделение,СписокПодразделений)

Функция СМГ_ПолучитьСписокРабот(Модель) Экспорт
	
	   СЗ = Новый СписокЗначений();
	
	   Запрос = Новый Запрос();
	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтоработыНормыВремени.Модель,
		|	АвтоработыНормыВремени.Ссылка КАК Авторабота 
		|ИЗ
		|	Справочник.Автоработы.НормыВремени КАК АвтоработыНормыВремени
		|ГДЕ
		|	АвтоработыНормыВремени.Модель = &Модель";
		
		Запрос.УстановитьПараметр("Модель", Модель);
		
		СЗ.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Авторабота"));
		
		Возврат СЗ;

КонецФункции // СМГ_ПолучитьСписокРабот(Модель)
//Бондаренко-- 20220403
